docs/logic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-21 Tue 16:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Propositional logic and recursive datatypes</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Propositional logic and recursive datatypes</h1>
<div id="outline-container-orge0dba96" class="outline-3">
<h3 id="orge0dba96"><span class="section-number-3">0.1.</span> Formal grammars in Haskell</h3>
<div class="outline-text-3" id="text-0-1">
<ul class="org-ul">
<li>Haskell's type system can be used to represent grammars as datatypes.</li>
<li>Grammars of non-trivial formal languages/natural languages typically involve <i>recursive</i> rules for well-formed formulas/sentences</li>
<li>An example from a CFG for natural language:</li>
</ul>

<div class="org-src-container">
<pre class="src src-nil">S -&gt; NP VP
VP -&gt; V S
</pre>
</div>

<ul class="org-ul">
<li>"She is upset."</li>
<li>"Zach said she is upset."</li>
<li>"Jenna believes Zach said she is upset."</li>
</ul>
</div>
</div>
<div id="outline-container-org0e088c4" class="outline-3">
<h3 id="org0e088c4"><span class="section-number-3">0.2.</span> Formal grammars in Haskell cont.</h3>
<div class="outline-text-3" id="text-0-2">
<ul class="org-ul">
<li>In order to implement recursive grammars in Haskell, we use <i>recursive datatypes</i>.
<ul class="org-ul">
<li>Operations that apply to inhabitants of recursive datatypes are (typically) recursive functions.</li>
<li>Today we'll learn about recursive datatypes/functions in Haskell, using the simple example of propositional logic.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf144b7a" class="outline-3">
<h3 id="orgf144b7a"><span class="section-number-3">0.3.</span> Homework</h3>
<div class="outline-text-3" id="text-0-3">
<ul class="org-ul">
<li>Next week we'll talk about semantics, again using propositional logic as an example.</li>
<li>For homework, read chapter 5 of  <i>Computational semantics with functional programming</i> "Formal semantics for fragments".</li>
</ul>
</div>
</div>
<div id="outline-container-org432e78d" class="outline-2">
<h2 id="org432e78d"><span class="section-number-2">1.</span> Propositional logic</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1a5951d" class="outline-3">
<h3 id="org1a5951d"><span class="section-number-3">1.1.</span> Sentences of propositional logic</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Sentences of propositional logic:
</p>

<ul class="org-ul">
<li>\(p \wedge q\)</li>
<li>\(p \wedge (q \rightarrow r)\)</li>
<li>\(p \vee \neg (q \wedge p)\)</li>
<li>\(\bot \rightarrow (\top \vee (q \wedge r))\)</li>
</ul>
</div>
</div>
<div id="outline-container-org69e0106" class="outline-3">
<h3 id="org69e0106"><span class="section-number-3">1.2.</span> Grammar of propositional logic</h3>
<div class="outline-text-3" id="text-1-2">
<p>
To state a grammar for propositional logic, we first need a set of variables \(\mathbf{Var} := \set{p, q, r, \ldots}\), and a set of constants \(\set{\top,\bot}\).
</p>

<ul class="org-ul">
<li>If \(p \in \mathbf{Var} \cup \set{\top,\bot}\), then \(p\) is a sentence of propositional logic.</li>
<li>If \(\phi,\psi\) are sentences of propositional logic, then \((\phi \wedge \psi)\) is a sentence of propositional logic.</li>
<li>If \(\phi,\psi\) are sentences of propositional logic, then \((\phi \vee \psi)\) is a sentence of propositional logic.</li>
<li>If \(\phi,\psi\) are sentences of propositional logic, then \((\phi \rightarrow \psi)\) is a sentence of propositional logic.</li>
<li>If \(\phi \) is a sentence of propositional logic, then so is \(\neg \phi \)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb22f661" class="outline-3">
<h3 id="orgb22f661"><span class="section-number-3">1.3.</span> The grammar as a datatype</h3>
<div class="outline-text-3" id="text-1-3">
<p>
We'll use a <i>sum type</i> to implement the grammar of propositional logic. We can start with just the following:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">String</span> <span style="color: #cba6f7;">deriving</span> (<span style="color: #cba6f7;">Eq</span>,<span style="color: #cba6f7;">Show</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>)
<span style="color: #cba6f7;">PropL</span>
ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p3"</span>)
<span style="color: #cba6f7;">PropL</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgee0759a" class="outline-3">
<h3 id="orgee0759a"><span class="section-number-3">1.4.</span> Adding negation: recursive datatypes!</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">String</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PNot</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #cba6f7;">deriving</span> (<span style="color: #cba6f7;">Eq</span>,<span style="color: #cba6f7;">Show</span>)
</pre>
</div>

<p>
Note that we <i>reuse</i> <code>PropL</code> in the constructor for negative sentences; this means that if an expression <code>p</code> is of type <code>PropL</code>, then <code>PNot p</code> is of type <code>PropL</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>))
<span style="color: #cba6f7;">PropL</span>
ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>)))
<span style="color: #cba6f7;">PropL</span>
</pre>
</div>

<p>
Note that this already gives us infinite inhabitants of type <code>PropL</code>.
</p>
</div>
</div>
<div id="outline-container-org788555e" class="outline-3">
<h3 id="org788555e"><span class="section-number-3">1.5.</span> Adding connectives</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">String</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PNot</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PAnd</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">POr</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #cba6f7;">deriving</span> (<span style="color: #cba6f7;">Eq</span>,<span style="color: #cba6f7;">Show</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #cba6f7;">PAnd</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>) (<span style="color: #cba6f7;">POr</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p2"</span>) (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p3"</span>)))
<span style="color: #cba6f7;">PropL</span>
ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #cba6f7;">PAnd</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>))
error
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad36393" class="outline-3">
<h3 id="orgad36393"><span class="section-number-3">1.6.</span> Bonus: infix constructors!</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Functions that take two arguments can be used as <i>infix operators</i> by enclosing them in backticks. This also goes for constructors:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t <span style="color: #cba6f7;">PAnd</span>
  <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #cba6f7;">PropL</span>
ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t ((<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>) <span style="color: #89dceb;">`PAnd`</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p2"</span>))
<span style="color: #cba6f7;">PropL</span>
</pre>
</div>

<p>
You can even use infix constructors in the data declaration:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">String</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PNot</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">`PAnd`</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">`POr`</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #cba6f7;">deriving</span> (<span style="color: #cba6f7;">Eq</span>,<span style="color: #cba6f7;">Show</span>)
</pre>
</div>
</div>
</div>
