handouts/logic.org
** Implementing a custom ~Show~ instance

Implementing a custom ~Show~ instance for ~PropL~ simply amounts to defining a function ~show~ of type ~PropL -> String~.

#+begin_src haskell
  data PropL = PVar String | PNot PropL | PropL `PAnd` PropL | PropL `POr` PropL deriving Eq

  instance Show PropL where
    show (PVar s) = s
    show (PNot p) = "~" ++ show p
    show (p `PAnd` q) = "(" ++ show p ++ " & " ++ show q ++ ")"
    show (p `POr` q) = "(" ++ show p ++ " | " ++ show q ++ ")"
#+end_src

** Custom ~Show~ cont.

The ~Show~ instance we just declared will automatically be used by ghci. 

#+begin_src haskell
  ghci> ((PVar "p1") `PAnd` (PNot ((PVar "p1") `POr` (PVar "p3")))
  (p1 & ~(p2 | p3)) 
#+end_src

We can also use it explicitly by calling ~show~ on something of type ~PropL~.

** ASTs

Recursive datatypes are used to create an Abstract Syntax Tree (AST) for sentences of propositional logic.

#+begin_export latex
\begin{forest}
 [{\texttt{PropL}}
   [{\texttt{p1}}]
   [{\texttt{PAnd}}]
   [{\texttt{PropL}}
     [{\texttt{PNot}}]
     [{\texttt{PropL}}
       [{\texttt{p2}}]
       [{\texttt{POr}}]
       [{\texttt{p3}}]
]
]
] 
\end{forest}
#+end_export

** Recursive functions

Let's say that we want to compute the number of operators in a formula. In order to do so we'll need a recursive function ~opsNr~.

First, we define the base of the recursion (where the recursion halts):


#+begin_src haskell
  opsNr :: PropL -> Int
  opsNr (PVar _) = 0
#+end_src

** Recursive functions cont.

For all other cases we need recursion:

#+begin_src haskell
  opsNr :: PropL -> Int
  opsNr (PVar _) = 0
  opsNr (PNot p) = 1 + opsNr p
  opsNr (PAnd p q) = 1 + opsNr p + opsNr q
  opsNr (POr p q) = 1 + opsNr p + opsNr q
#+end_src

** Another recursive function: depth

#+begin_src haskell
  depth :: PropL -> Int
  depth (PVar _) = 0
  depth (PNot p) = 1 + depth p
  opsNr (PAnd p q) = undefined
  opsNr (POr p q) = undefined
#+end_src

** Depth cont.

#+begin_src haskell
  depth :: PropL -> Int
  depth (PVar _) = 0
  depth (PNot p) = 1 + depth p
  depth (PAnd p q) = 1 + max (depth p) (depth q)
  depth (POr p q) = 1 + max (depth p) (depth q)
#+end_src

** Exercise: gather names

- *Exercise:*  write a recursive function that returns a list of all of the variables that occur in a formula. 
- As a bonus, remove duplicates and sort the output alphabetically. 
   
** Normalization

- A formula of propositional logic is in /conjunctive normal form/ (CNF) iff it is a conjunction of one of more *clauses*.
  * A clause is a disjunction of one or more literals; a literal is either a propositional variable, or the negation of a propositional variable.
  * Some formulas in conjunctive normal form:

- \((p \vee \neg q \vee r) \wedge s\)
- \((p \vee q) \wedge r\)
- \(p\)

** Conversion to CNF and rules of inference

- Any formula can be converted into CNF by successively applying the following rules of inference:
  * \(\neg \neg \phi \Rightarrow \phi \) (*Double Negation Elimination*; DNE)
  * \(\neg (\phi \vee \psi) \Rightarrow \neg \phi  \wedge \neg \psi\) (*De Morgan's law 1*; dM1)
  * \(\neg (\phi \wedge \psi) \Rightarrow \neg \phi  \vee \neg \psi\) (*De Morgan's law 2*; dM1)
  * \(\phi \vee (\psi \wedge \rho) \Rightarrow (\phi \vee \psi) \wedge (\phi \vee \rho)\) (*Distributive Law*; DL)
- Conversion to CNF can be accomplished by:
  * Pushing negations in, by repeatedly applying dM.
  * Getting rid of any double negations via DNE.
  * Repeatedly applying DL, to get rid of disjunctions applying over conjunctions.
    
** An example

\[\neg (\neg (p \vee q) \wedge r) \wedge \neg (p \wedge r)\]

\[\begin{aligned}[t]
&\Rightarrow (\neg \neg (p \vee q) \vee r) \wedge \neg (p \wedge r)\\
&\Rightarrow (\neg \neg (p \vee q) \vee r) \wedge (\neg p \vee \neg r)\\
&\Rightarrow (p \vee q \vee r) \wedge (\neg p \vee \neg r)
\end{aligned}\]
 
