docs/logic.html
<div id="outline-container-org90aba16" class="outline-3">
<h3 id="org90aba16"><span class="section-number-3">1.7.</span> Implementing a custom <code>Show</code> instance</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Implementing a custom <code>Show</code> instance for <code>PropL</code> simply amounts to defining a function <code>show</code> of type <code>PropL -&gt; String</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">String</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PNot</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">`PAnd`</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">`POr`</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #cba6f7;">deriving</span> <span style="color: #cba6f7;">Eq</span>

<span style="color: #cba6f7;">instance</span> <span style="color: #f9e2af;">Show</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #cba6f7;">where</span>
  show (<span style="color: #cba6f7;">PVar</span> s) <span style="color: #89dceb;">=</span> s
  show (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> <span style="color: #a6e3a1;">"~"</span> <span style="color: #89dceb;">++</span> show p
  show (p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">=</span> <span style="color: #a6e3a1;">"("</span> <span style="color: #89dceb;">++</span> show p <span style="color: #89dceb;">++</span> <span style="color: #a6e3a1;">" &amp; "</span> <span style="color: #89dceb;">++</span> show q <span style="color: #89dceb;">++</span> <span style="color: #a6e3a1;">")"</span>
  show (p <span style="color: #89dceb;">`POr`</span> q) <span style="color: #89dceb;">=</span> <span style="color: #a6e3a1;">"("</span> <span style="color: #89dceb;">++</span> show p <span style="color: #89dceb;">++</span> <span style="color: #a6e3a1;">" | "</span> <span style="color: #89dceb;">++</span> show q <span style="color: #89dceb;">++</span> <span style="color: #a6e3a1;">")"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb65f6f8" class="outline-3">
<h3 id="orgb65f6f8"><span class="section-number-3">1.8.</span> Custom <code>Show</code> cont.</h3>
<div class="outline-text-3" id="text-1-8">
<p>
The <code>Show</code> instance we just declared will automatically be used by ghci. 
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> ((<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>) <span style="color: #89dceb;">`PAnd`</span> (<span style="color: #cba6f7;">PNot</span> ((<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span>) <span style="color: #89dceb;">`POr`</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p3"</span>)))
(p1 <span style="color: #89dceb;">&amp;</span> <span style="color: #89dceb;">~</span>(p2 <span style="color: #89dceb;">|</span> p3)) 
</pre>
</div>

<p>
We can also use it explicitly by calling <code>show</code> on something of type <code>PropL</code>.
</p>
</div>
</div>
<div id="outline-container-org79dc2e3" class="outline-3">
<h3 id="org79dc2e3"><span class="section-number-3">1.9.</span> ASTs</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Recursive datatypes are used to create an Abstract Syntax Tree (AST) for sentences of propositional logic.
</p>
</div>
</div>
<div id="outline-container-orgd3762db" class="outline-3">
<h3 id="orgd3762db"><span class="section-number-3">1.10.</span> Recursive functions</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Let's say that we want to compute the number of operators in a formula. In order to do so we'll need a recursive function <code>opsNr</code>.
</p>

<p>
First, we define the base of the recursion (where the recursion halts):
</p>


<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">opsNr</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">Int</span>
<span style="color: #89b4fa;">opsNr</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">_</span>) <span style="color: #89dceb;">=</span> 0
</pre>
</div>
</div>
</div>
<div id="outline-container-org8fee79f" class="outline-3">
<h3 id="org8fee79f"><span class="section-number-3">1.11.</span> Recursive functions cont.</h3>
<div class="outline-text-3" id="text-1-11">
<p>
For all other cases we need recursion:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">opsNr</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">Int</span>
<span style="color: #89b4fa;">opsNr</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">_</span>) <span style="color: #89dceb;">=</span> 0
<span style="color: #89b4fa;">opsNr</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> 1 <span style="color: #89dceb;">+</span> opsNr p
<span style="color: #89b4fa;">opsNr</span> (<span style="color: #cba6f7;">PAnd</span> p q) <span style="color: #89dceb;">=</span> 1 <span style="color: #89dceb;">+</span> opsNr p <span style="color: #89dceb;">+</span> opsNr q
<span style="color: #89b4fa;">opsNr</span> (<span style="color: #cba6f7;">POr</span> p q) <span style="color: #89dceb;">=</span> 1 <span style="color: #89dceb;">+</span> opsNr p <span style="color: #89dceb;">+</span> opsNr q
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcdc5dfd" class="outline-3">
<h3 id="orgcdc5dfd"><span class="section-number-3">1.12.</span> Another recursive function: depth</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">depth</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">Int</span>
<span style="color: #89b4fa;">depth</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">_</span>) <span style="color: #89dceb;">=</span> 0
<span style="color: #89b4fa;">depth</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> 1 <span style="color: #89dceb;">+</span> depth p
<span style="color: #89b4fa;">opsNr</span> (<span style="color: #cba6f7;">PAnd</span> p q) <span style="color: #89dceb;">=</span> undefined
<span style="color: #89b4fa;">opsNr</span> (<span style="color: #cba6f7;">POr</span> p q) <span style="color: #89dceb;">=</span> undefined
</pre>
</div>
</div>
</div>
<div id="outline-container-org6dda7b5" class="outline-3">
<h3 id="org6dda7b5"><span class="section-number-3">1.13.</span> Depth cont.</h3>
<div class="outline-text-3" id="text-1-13">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">depth</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">Int</span>
<span style="color: #89b4fa;">depth</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">_</span>) <span style="color: #89dceb;">=</span> 0
<span style="color: #89b4fa;">depth</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> 1 <span style="color: #89dceb;">+</span> depth p
<span style="color: #89b4fa;">depth</span> (<span style="color: #cba6f7;">PAnd</span> p q) <span style="color: #89dceb;">=</span> 1 <span style="color: #89dceb;">+</span> max (depth p) (depth q)
<span style="color: #89b4fa;">depth</span> (<span style="color: #cba6f7;">POr</span> p q) <span style="color: #89dceb;">=</span> 1 <span style="color: #89dceb;">+</span> max (depth p) (depth q)
</pre>
</div>
</div>
</div>
<div id="outline-container-org60ecae7" class="outline-3">
<h3 id="org60ecae7"><span class="section-number-3">1.14.</span> Exercise: gather names</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li><b>Exercise:</b>  write a recursive function that returns a list of all of the variables that occur in a formula.</li>
<li>As a bonus, remove duplicates and sort the output alphabetically.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc274ebb" class="outline-3">
<h3 id="orgc274ebb"><span class="section-number-3">1.15.</span> Normalization</h3>
<div class="outline-text-3" id="text-1-15">
<ul class="org-ul">
<li>A formula of propositional logic is in <i>conjunctive normal form</i> (CNF) iff it is a conjunction of one of more <b>clauses</b>.
<ul class="org-ul">
<li>A clause is a disjunction of one or more literals; a literal is either a propositional variable, or the negation of a propositional variable.</li>
<li>Some formulas in conjunctive normal form:</li>
</ul></li>

<li>\((p \vee \neg q \vee r) \wedge s\)</li>
<li>\((p \vee q) \wedge r\)</li>
<li>\(p\)</li>
</ul>
</div>
</div>
<div id="outline-container-org776ed5a" class="outline-3">
<h3 id="org776ed5a"><span class="section-number-3">1.16.</span> Conversion to CNF and rules of inference</h3>
<div class="outline-text-3" id="text-1-16">
<ul class="org-ul">
<li>Any formula can be converted into CNF by successively applying the following rules of inference:
<ul class="org-ul">
<li>\(\neg \neg \phi \Rightarrow \phi \) (<b>Double Negation Elimination</b>; DNE)</li>
<li>\(\neg (\phi \vee \psi) \Rightarrow \neg \phi  \wedge \neg \psi\) (<b>De Morgan's law 1</b>; dM1)</li>
<li>\(\neg (\phi \wedge \psi) \Rightarrow \neg \phi  \vee \neg \psi\) (<b>De Morgan's law 2</b>; dM1)</li>
<li>\(\phi \vee (\psi \wedge \rho) \Rightarrow (\phi \vee \psi) \wedge (\phi \vee \rho)\) (<b>Distributive Law</b>; DL)</li>
</ul></li>
<li>Conversion to CNF can be accomplished by:
<ul class="org-ul">
<li>Pushing negations in, by repeatedly applying dM.</li>
<li>Getting rid of any double negations via DNE.</li>
<li>Repeatedly applying DL, to get rid of disjunctions applying over conjunctions.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgca614a8" class="outline-3">
<h3 id="orgca614a8"><span class="section-number-3">1.17.</span> An example</h3>
<div class="outline-text-3" id="text-1-17">
<p>
\[\neg (\neg (p \vee q) \wedge r) \wedge \neg (p \wedge r)\]
</p>

<p>
\[\begin{aligned}[t]
&\Rightarrow (\neg \neg (p \vee q) \vee r) \wedge \neg (p \wedge r)\\
&\Rightarrow (\neg \neg (p \vee q) \vee r) \wedge (\neg p \vee \neg r)\\
&\Rightarrow (p \vee q \vee r) \wedge (\neg p \vee \neg r)
\end{aligned}\]
</p>
</div>
</div>
