handouts/logic.org
** Implementation in Haskell

- Let's try to write a function to implement this procedure in Haskell.
- We know what the type of this function should be:

#+begin_src haskell
  toCNF :: PropL -> PropL
  toCNF = undefined
#+end_src

** Pushing negation in

We'll break this function down into three steps.

- First, let's push negations inward by repeatedly applying dM.
- Second, let's get rid of any resulting double negations.
- Third, let's distribute conjunctions over disjunctions.
  
#+begin_src haskell
  toCNF :: PropL -> PropL
  toCNF = distributeConj . elimDN . pushNegsIn

  dM :: PropL -> PropL
  dM :: PropL -> PropL   

  dne :: PropL -> PropL
  dne = undefined

  distLaw :: PropL -> PropL
  distLaw = undefined
#+end_src

** First step: de Morgan's

We can apply de Morgan's via heavy use of /pattern matching/.

#+begin_src haskell
  dM :: PropL -> PropL
  dM (PNot (p `POr` q)) = (PNot p) `PAnd` (PNot q)
  dM p = p
#+end_src

Pattern matching applies wherever possible, making the second line an elsewhere case.

** de Morgan's continued

#+begin_src haskell
  dM :: PropL -> PropL
  dM (PNot (p `PAnd` q)) = (PNot p) `POr` (PNot q)
  dM (PNot (p `POr` q)) = (PNot p) `PAnd` (PNot q)
  dM p = p
#+end_src

** Non-recursive

- Note that the function we just defined is /not recursive/.
  * It only applies de Morgan's if the /top level formula/ matches the structural description imposed by pattern matching.
    
#+begin_src haskell
  ghci> dM (PVar "p1" `PAnd` PNot (PVar "p2" `POr` PVar "p3"))
  (p1 & ~(p2 | p3))
#+end_src

- In order to eventually convert to CNF we need to apply ~dM~ /recursively/.
- *Exercise:* write a recursive variant of ~dM~.
  
** Recursive application of de Morgan's

#+begin_src haskell
  dM :: PropL -> PropL
  dM (PNot (p `PAnd` q)) = (PNot (dM p)) `POr` (PNot (dM q))
  dM (PNot (p `POr` q)) = (PNot (dM p)) `PAnd` (PNot (dM q))
  dM (PNot p) = PNot (dM p)
  dM (p `PAnd` q) = dM p `PAnd` dM q
  dM (p `POr` q) = dM p `POr` dM q
  dM (PVar p) = PVar p
#+end_src

** Double Negation Elimination

- Double negation elimination is a bit simpler.
- First, the non-recursive variant:

#+begin_src haskell
  dne :: PropL -> PropL
  dne (PNot (PNot p)) = p
  dne p = p
#+end_src

- *Exercise:* make this apply recursively

** Recursive DNE

#+begin_src haskell
  dne :: PropL -> PropL
  dne (PNot (PNot p)) = dne p
  dne (PNot p) = PNot (dne p)
  dne (p `PAnd` q) = dne p `PAnd` dne q 
  dne (p `POr` q) = dne p `POr` dne q 
  dne (PVar p) = PVar p
#+end_src

** Distributive Law

First, the non-recursive variant (we're really stretching the limits of pattern matching):

Our statement of the distributive law actually subsumes three different cases:

#+begin_src haskell 
  distLaw :: PropL -> PropL 
  distLaw ((p `PAnd` q) `POr` (r `PAnd` s)) = (p `POr` r) `PAnd` (p `POr` s) `PAnd` (q `POr` r) `PAnd` (q `POr` s) -- double distributivity
  distLaw (p `POr` (q `PAnd` r)) = (p `POr` q) `PAnd` (p `POr` r) --left dist
  distLaw ((q `PAnd` r) `POr` p) = (q `POr` p) `PAnd` (r `POr` p) --right dist
  distLaw p = p
#+end_src

- *Exercise:* write the recursive variant!

