docs/logic.html
<div id="outline-container-org631e581" class="outline-3">
<h3 id="org631e581"><span class="section-number-3">1.18.</span> Implementation in Haskell</h3>
<div class="outline-text-3" id="text-1-18">
<ul class="org-ul">
<li>Let's try to write a function to implement this procedure in Haskell.</li>
<li>We know what the type of this function should be:</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">toCNF</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">toCNF</span> <span style="color: #89dceb;">=</span> undefined
</pre>
</div>
</div>
</div>
<div id="outline-container-org6939150" class="outline-3">
<h3 id="org6939150"><span class="section-number-3">1.19.</span> Pushing negation in</h3>
<div class="outline-text-3" id="text-1-19">
<p>
We'll break this function down into three steps.
</p>

<ul class="org-ul">
<li>First, let's push negations inward by repeatedly applying dM.</li>
<li>Second, let's get rid of any resulting double negations.</li>
<li>Third, let's distribute conjunctions over disjunctions.</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">toCNF</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">toCNF</span> <span style="color: #89dceb;">=</span> distributeConj <span style="color: #89dceb;">.</span> elimDN <span style="color: #89dceb;">.</span> pushNegsIn

<span style="color: #89b4fa;">dM</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">dM</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>   

<span style="color: #89b4fa;">dne</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">dne</span> <span style="color: #89dceb;">=</span> undefined

<span style="color: #89b4fa;">distLaw</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">distLaw</span> <span style="color: #89dceb;">=</span> undefined
</pre>
</div>
</div>
</div>
<div id="outline-container-org60b1057" class="outline-3">
<h3 id="org60b1057"><span class="section-number-3">1.20.</span> First step: de Morgan's</h3>
<div class="outline-text-3" id="text-1-20">
<p>
We can apply de Morgan's via heavy use of <i>pattern matching</i>.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">dM</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">dM</span> (<span style="color: #cba6f7;">PNot</span> (p <span style="color: #89dceb;">`POr`</span> q)) <span style="color: #89dceb;">=</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">`PAnd`</span> (<span style="color: #cba6f7;">PNot</span> q)
<span style="color: #89b4fa;">dM</span> p <span style="color: #89dceb;">=</span> p
</pre>
</div>

<p>
Pattern matching applies wherever possible, making the second line an elsewhere case.
</p>
</div>
</div>
<div id="outline-container-orgbe07f23" class="outline-3">
<h3 id="orgbe07f23"><span class="section-number-3">1.21.</span> de Morgan's continued</h3>
<div class="outline-text-3" id="text-1-21">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">dM</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">dM</span> (<span style="color: #cba6f7;">PNot</span> (p <span style="color: #89dceb;">`PAnd`</span> q)) <span style="color: #89dceb;">=</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">`POr`</span> (<span style="color: #cba6f7;">PNot</span> q)
<span style="color: #89b4fa;">dM</span> (<span style="color: #cba6f7;">PNot</span> (p <span style="color: #89dceb;">`POr`</span> q)) <span style="color: #89dceb;">=</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">`PAnd`</span> (<span style="color: #cba6f7;">PNot</span> q)
<span style="color: #89b4fa;">dM</span> p <span style="color: #89dceb;">=</span> p
</pre>
</div>
</div>
</div>
<div id="outline-container-org4069548" class="outline-3">
<h3 id="org4069548"><span class="section-number-3">1.22.</span> Non-recursive</h3>
<div class="outline-text-3" id="text-1-22">
<ul class="org-ul">
<li>Note that the function we just defined is <i>not recursive</i>.
<ul class="org-ul">
<li>It only applies de Morgan's if the <i>top level formula</i> matches the structural description imposed by pattern matching.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> dM (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p1"</span> <span style="color: #89dceb;">`PAnd`</span> <span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p2"</span> <span style="color: #89dceb;">`POr`</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p3"</span>))
(p1 <span style="color: #89dceb;">&amp;</span> <span style="color: #89dceb;">~</span>(p2 <span style="color: #89dceb;">|</span> p3))
</pre>
</div>

<ul class="org-ul">
<li>In order to eventually convert to CNF we need to apply <code>dM</code> <i>recursively</i>.</li>
<li><b>Exercise:</b> write a recursive variant of <code>dM</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org00f0621" class="outline-3">
<h3 id="org00f0621"><span class="section-number-3">1.23.</span> Recursive application of de Morgan's</h3>
<div class="outline-text-3" id="text-1-23">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">dM</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">dM</span> (<span style="color: #cba6f7;">PNot</span> (p <span style="color: #89dceb;">`PAnd`</span> q)) <span style="color: #89dceb;">=</span> (<span style="color: #cba6f7;">PNot</span> (dM p)) <span style="color: #89dceb;">`POr`</span> (<span style="color: #cba6f7;">PNot</span> (dM q))
<span style="color: #89b4fa;">dM</span> (<span style="color: #cba6f7;">PNot</span> (p <span style="color: #89dceb;">`POr`</span> q)) <span style="color: #89dceb;">=</span> (<span style="color: #cba6f7;">PNot</span> (dM p)) <span style="color: #89dceb;">`PAnd`</span> (<span style="color: #cba6f7;">PNot</span> (dM q))
<span style="color: #89b4fa;">dM</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PNot</span> (dM p)
<span style="color: #89b4fa;">dM</span> (p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">=</span> dM p <span style="color: #89dceb;">`PAnd`</span> dM q
<span style="color: #89b4fa;">dM</span> (p <span style="color: #89dceb;">`POr`</span> q) <span style="color: #89dceb;">=</span> dM p <span style="color: #89dceb;">`POr`</span> dM q
<span style="color: #89b4fa;">dM</span> (<span style="color: #cba6f7;">PVar</span> p) <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> p
</pre>
</div>
</div>
</div>
<div id="outline-container-org29523c6" class="outline-3">
<h3 id="org29523c6"><span class="section-number-3">1.24.</span> Double Negation Elimination</h3>
<div class="outline-text-3" id="text-1-24">
<ul class="org-ul">
<li>Double negation elimination is a bit simpler.</li>
<li>First, the non-recursive variant:</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">dne</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">dne</span> (<span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PNot</span> p)) <span style="color: #89dceb;">=</span> p
<span style="color: #89b4fa;">dne</span> p <span style="color: #89dceb;">=</span> p
</pre>
</div>

<ul class="org-ul">
<li><b>Exercise:</b> make this apply recursively</li>
</ul>
</div>
</div>
<div id="outline-container-orge6f9e28" class="outline-3">
<h3 id="orge6f9e28"><span class="section-number-3">1.25.</span> Recursive DNE</h3>
<div class="outline-text-3" id="text-1-25">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">dne</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span>
<span style="color: #89b4fa;">dne</span> (<span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PNot</span> p)) <span style="color: #89dceb;">=</span> dne p
<span style="color: #89b4fa;">dne</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PNot</span> (dne p)
<span style="color: #89b4fa;">dne</span> (p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">=</span> dne p <span style="color: #89dceb;">`PAnd`</span> dne q 
<span style="color: #89b4fa;">dne</span> (p <span style="color: #89dceb;">`POr`</span> q) <span style="color: #89dceb;">=</span> dne p <span style="color: #89dceb;">`POr`</span> dne q 
<span style="color: #89b4fa;">dne</span> (<span style="color: #cba6f7;">PVar</span> p) <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> p
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b0bb80" class="outline-3">
<h3 id="org3b0bb80"><span class="section-number-3">1.26.</span> Distributive Law</h3>
<div class="outline-text-3" id="text-1-26">
<p>
First, the non-recursive variant (we're really stretching the limits of pattern matching):
</p>

<p>
Our statement of the distributive law actually subsumes three different cases:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">distLaw</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span> 
<span style="color: #89b4fa;">distLaw</span> ((p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">`POr`</span> (r <span style="color: #89dceb;">`PAnd`</span> s)) <span style="color: #89dceb;">=</span> (p <span style="color: #89dceb;">`POr`</span> r) <span style="color: #89dceb;">`PAnd`</span> (p <span style="color: #89dceb;">`POr`</span> s) <span style="color: #89dceb;">`PAnd`</span> (q <span style="color: #89dceb;">`POr`</span> r) <span style="color: #89dceb;">`PAnd`</span> (q <span style="color: #89dceb;">`POr`</span> s) <span style="color: #6c7086;">-- </span><span style="color: #6c7086;">double distributivity</span>
<span style="color: #89b4fa;">distLaw</span> (p <span style="color: #89dceb;">`POr`</span> (q <span style="color: #89dceb;">`PAnd`</span> r)) <span style="color: #89dceb;">=</span> (p <span style="color: #89dceb;">`POr`</span> q) <span style="color: #89dceb;">`PAnd`</span> (p <span style="color: #89dceb;">`POr`</span> r) <span style="color: #6c7086;">--</span><span style="color: #6c7086;">left dist</span>
<span style="color: #89b4fa;">distLaw</span> ((q <span style="color: #89dceb;">`PAnd`</span> r) <span style="color: #89dceb;">`POr`</span> p) <span style="color: #89dceb;">=</span> (q <span style="color: #89dceb;">`POr`</span> p) <span style="color: #89dceb;">`PAnd`</span> (r <span style="color: #89dceb;">`POr`</span> p) <span style="color: #6c7086;">--</span><span style="color: #6c7086;">right dist</span>
<span style="color: #89b4fa;">distLaw</span> p <span style="color: #89dceb;">=</span> p
</pre>
</div>

<ul class="org-ul">
<li><b>Exercise:</b> write the recursive variant!</li>
</ul>
</div>
</div>
