handouts/logic.org
** Recursive distributive law


#+begin_src haskell 
  distLaw :: PropL -> PropL 
  distLaw ((p `PAnd` q) `POr` (r `PAnd` s)) = (distLaw p `POr` distLaw r) `PAnd` (distLaw p `POr` distLaw s) `PAnd` (distLaw q `POr` distLaw r) `PAnd` (distLaw q `POr` distLaw s) -- double distributivity
  distLaw (p `POr` (q `PAnd` r)) = (distLaw p `POr` distLaw q) `PAnd` (distLaw p `POr` r) --left dist
  distLaw ((q `PAnd` r) `POr` p) = (distLaw q `POr` distLaw p) `PAnd` (distLaw r `POr` distLaw p) --right dist
  distLaw (PNot p) = PNot (distLaw p)
  distLaw (p `PAnd` q) = distLaw p `PAnd` distLaw q
  distLaw (p `POr` q) = distLaw p `POr` distLaw q
  distLaw (PVar p) = PVar p
#+end_src

** Mini assignment

- A function that maps formulas of propositional logic to a truth table.
- You can treat a truth table as a list of /pairs/ of variable assignments and truth values.
- A variable assignment is a list of pairs of variables and truth values.

** 
   :PROPERTIES:
   :BEAMER_opt: label=findings,standout
   :END:
 
   \(\mathscr{Fin}\)




** References

#+print_bibliography:

# Local Variables:
# org-latex-src-block-backend: engraved
# End:
