docs/logic.html
<div id="outline-container-org7ab8ac4" class="outline-3">
<h3 id="org7ab8ac4"><span class="section-number-3">1.27.</span> Recursive distributive law</h3>
<div class="outline-text-3" id="text-1-27">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">distLaw</span> <span style="color: #89dceb;">::</span> <span style="color: #f9e2af;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #f9e2af;">PropL</span> 
<span style="color: #89b4fa;">distLaw</span> ((p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">`POr`</span> (r <span style="color: #89dceb;">`PAnd`</span> s)) <span style="color: #89dceb;">=</span> (distLaw p <span style="color: #89dceb;">`POr`</span> distLaw r) <span style="color: #89dceb;">`PAnd`</span> (distLaw p <span style="color: #89dceb;">`POr`</span> distLaw s) <span style="color: #89dceb;">`PAnd`</span> (distLaw q <span style="color: #89dceb;">`POr`</span> distLaw r) <span style="color: #89dceb;">`PAnd`</span> (distLaw q <span style="color: #89dceb;">`POr`</span> distLaw s) <span style="color: #6c7086;">-- </span><span style="color: #6c7086;">double distributivity</span>
<span style="color: #89b4fa;">distLaw</span> (p <span style="color: #89dceb;">`POr`</span> (q <span style="color: #89dceb;">`PAnd`</span> r)) <span style="color: #89dceb;">=</span> (distLaw p <span style="color: #89dceb;">`POr`</span> distLaw q) <span style="color: #89dceb;">`PAnd`</span> (distLaw p <span style="color: #89dceb;">`POr`</span> r) <span style="color: #6c7086;">--</span><span style="color: #6c7086;">left dist</span>
<span style="color: #89b4fa;">distLaw</span> ((q <span style="color: #89dceb;">`PAnd`</span> r) <span style="color: #89dceb;">`POr`</span> p) <span style="color: #89dceb;">=</span> (distLaw q <span style="color: #89dceb;">`POr`</span> distLaw p) <span style="color: #89dceb;">`PAnd`</span> (distLaw r <span style="color: #89dceb;">`POr`</span> distLaw p) <span style="color: #6c7086;">--</span><span style="color: #6c7086;">right dist</span>
<span style="color: #89b4fa;">distLaw</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PNot</span> (distLaw p)
<span style="color: #89b4fa;">distLaw</span> (p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">=</span> distLaw p <span style="color: #89dceb;">`PAnd`</span> distLaw q
<span style="color: #89b4fa;">distLaw</span> (p <span style="color: #89dceb;">`POr`</span> q) <span style="color: #89dceb;">=</span> distLaw p <span style="color: #89dceb;">`POr`</span> distLaw q
<span style="color: #89b4fa;">distLaw</span> (<span style="color: #cba6f7;">PVar</span> p) <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> p
</pre>
</div>
</div>
</div>
<div id="outline-container-orgba3994d" class="outline-3">
<h3 id="orgba3994d"><span class="section-number-3">1.28.</span> Mini assignment</h3>
<div class="outline-text-3" id="text-1-28">
<ul class="org-ul">
<li>A function that maps formulas of propositional logic to a truth table.</li>
<li>You can treat a truth table as a list of <i>pairs</i> of variable assignments and truth values.</li>
<li>A variable assignment is a list of pairs of variables and truth values.</li>
</ul>
</div>
</div>
<div id="outline-container-org036e469" class="outline-3">
<h3 id="org036e469"><span class="section-number-3">1.29.</span> </h3>
<div class="outline-text-3" id="text-1-29">
<p>
\(\mathscr{Fin}\)
</p>
</div>
</div>
<div id="outline-container-orge945bb5" class="outline-3">
<h3 id="orge945bb5"><span class="section-number-3">1.30.</span> References</h3>
<div class="outline-text-3" id="text-1-30">

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Patrick D. Elliott</p>
<p class="date">Created: 2024-05-21 Tue 16:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
